In [2]:
# Setting up
import pandas as pd
import numpy as np
import os

# Exercise 4.5 Reading

## Mixed Data Types:

In [3]:
# Create a dataframe
df_test = pd.DataFrame()

In [4]:
# Create a mixed type column
df_test["mix"] = ["a", "b", 1, True]

In [5]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [6]:
# Check for mixed type columns
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\tiffk\AppData\Local\Temp\ipykernel_7700\1892627677.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [7]:
# Check for mixed type columns (reattempt)
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [8]:
# Fixing column data type
df_test["mix"] = df_test["mix"].astype("str")

## Missing Values:

In [9]:
path = r"C:\Users\tiffk\Instacart Basket Analysis 22-05-2024"

In [10]:
df_prods = pd.read_csv(os.path.join(path, "02 Data", "Original Data", "products.csv"), index_col = False)

In [11]:
# Checking for count of null values in all columns
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
# Creating df of all rows where product_name column is NaN
df_nan = df_prods[df_prods["product_name"].isnull() == True]

In [13]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
# Counting all rows/columns in original products df
df_prods.shape

(49693, 5)

In [15]:
# Creating new products df free of NaN values
df_prods_clean = df_prods[df_prods["product_name"].isnull() == False]

In [16]:
# Check to ensure 16 rows were dropped
df_prods_clean.shape

(49677, 5)

## Duplicate Rows:

In [17]:
# Creating a df of duplicated rows
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
df_dups.shape

(5, 5)

In [20]:
# Creating new products df free of duplicated rows
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [21]:
# Code Check (should have dropped 5 more rows)
df_prods_clean_no_dups.shape

(49672, 5)

# Task Instructions

## Complete the data consistency checks from the exercise

Completed.

## Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [22]:
df_ords = pd.read_csv(os.path.join(path, "02 Data", "Prepared Data", "orders_wrangled.csv"), index_col = False)

In [23]:
df_ords.drop(columns = ["Unnamed: 0"], inplace = True)

In [24]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

order_id - No apparent issues

user_id - No apparent issues

order_number - The max value, 100, is an outlier in consideration to the other quartiles. It is however possible, if not probable, given the number of customers.

order_days_of_week - No apparent issues

order_hour_of_day - Max and Min values would indicate some orders are occuring at and around midnight (Which would be odd but is entirely possible for customers using an app)

days_since_prior_order - Min value likely indicates orders made on the same day (or within 24 hours of previous order). Max value is capped at 30 (per the data dictionary). Missing values are assigned where order_number = 1 (matches up perfectly with max user_id 206,209.

## Check for mixed-type data in your df_ords dataframe.

In [25]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col + " is mixed")
  else:
    print (col + " is consistent")

order_id is consistent
user_id is consistent
order_number is consistent
orders_day_of_week is consistent
order_hour_of_day is consistent
days_since_prior_order is consistent

## If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

In [26]:
# No mixed data types were observed. The data types are:
df_ords.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

## Run a check for missing values in your df_ords dataframe.

In [27]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

There are 206,209 missing values from days_since_prior_order. As previously mentioned, these values appear where order_number = 1 (since this is the customer's first order). The number of missing values also perfectly matches the max value of the user_id column.

## Address the missing values using an appropriate method.

For this part, I'll create a 'first_purchase' flag to indicate the rows where days_since_prior_order is NaN. This is the most correct method since deleting these rows would erase valuable information and potential insights.

However, to be sure the data dictionary is fully accurate and no smaller issues plague the data frame, I'll check that all 206,209 rows have an order_number of 1 and null value in the days_since_prior_order column:

In [28]:
# Create subset where order_number = 1 and days_since_prior_order is null
df_ords_check = df_ords[(df_ords["order_number"] == 1) & (df_ords["days_since_prior_order"].isnull())]

In [29]:
# Check subset (specifically row count)
df_ords_check

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

Check was successful - All NaN rows also have an order_number of 1. Proceed with creating flag:

In [30]:
df_ords["first_order"] = df_ords["days_since_prior_order"].isnull()

In [31]:
df_ords

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0,False
3421079,1854736,206209,11,4,10,30.0,False
3421080,626363,206209,12,1,12,18.0,False
3421081,2977660,206209,13,1,12,7.0,False
3421082,272231,206209,14,6,14,30.0,False

## Run a check for duplicate values in your df_ords data.

In [32]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [33]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

The dataframe created for checking duplicates retruned empty. Therefore, no duplicate rows exist in orders data set

## Address the duplicates using an appropriate method.

No duplicates to address

## Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [34]:
df_prods_clean_no_dups.to_csv(os.path.join(path, "02 Data", "Prepared Data", "products_checked.csv"))

In [35]:
df_ords.to_csv(os.path.join(path, "02 Data", "Prepared Data", "orders_checked.csv"))